parsing-tech-log/src/Catalogs/СобытияЗамера/СобытияЗамера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СобытияЗамера</name>
  <owners>Catalog.Замеры</owners>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ФайлыЗамера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытияМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеСвойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.Свойства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/СобытияЗамера/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗаписатьСобытие(СтруктураЗаписи) Экспорт
	СобытиеОбъект = Справочники.СобытияЗамера.СоздатьЭлемент();
	//реквизиты
	ЗаполнитьЗначенияСвойств(СобытиеОбъект, СтруктураЗаписи, "Владелец, ТипПроцесса, Файл, НомерСтрокиФайла, ДатаСобытия, ДатаСобытияМкс, ДлительностьМкс, ТипСобытия, УровеньСобытия, ВсеСвойства, Ключ");
	//тч
	Для Каждого элемент из СтруктураЗаписи.КлючевыеСвойства Цикл
		строкасвойства = СобытиеОбъект.КлючевыеСвойства.Добавить();
		строкасвойства.Свойство = элемент.Ключ;
		строкасвойства.Значение = элемент.Значение;
	КонецЦикла;
	СобытиеОбъект.Записать();
	Возврат СобытиеОбъект.Ссылка;
КонецФункции

Функция ЗаписатьСобытиеЧисло(СтруктураЗаписи) Экспорт
	СобытиеОбъект = Справочники.СобытияЗамера.СоздатьЭлемент();
	//реквизиты
	ЗаполнитьЗначенияСвойств(СобытиеОбъект, СтруктураЗаписи, "Владелец, ТипПроцесса, Файл, НомерСтрокиФайла, ДатаСобытия, ДатаСобытияМкс, ДлительностьМкс, ТипСобытия, УровеньСобытия, ВсеСвойства, Ключ");
	//тч
	Для Каждого элемент из СтруктураЗаписи.КлючевыеСвойства Цикл
		строкасвойства = СобытиеОбъект.КлючевыеСвойства.Добавить();
		строкасвойства.Свойство = элемент.Ключ;
		строкасвойства.Значение = элемент.Значение;
		строкасвойства.ЗначениеЧисло = элемент.Значение;
	КонецЦикла;
	СобытиеОбъект.Записать();
	Возврат СобытиеОбъект.Ссылка;
КонецФункции

#КонецЕсли
